#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.default will be created
  + resource "azurerm_resource_group" "default" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "rg12"
    }

  # azurerm_resource_group_template_deployment.default will be created
  + resource "azurerm_resource_group_template_deployment" "default" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "tesadwwhgsyghh"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "rg12"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + authAppId           = {
                      + type = "string"
                    }
                  + cmkEnabled          = {
                      + type = "bool"
                    }
                  + corsRules           = {
                      + type = "array"
                    }
                  + dataPartitionNames  = {
                      + type = "array"
                    }
                  + encryption          = {
                      + type = "object"
                    }
                  + identity            = {
                      + type = "object"
                    }
                  + location            = {
                      + type = "string"
                    }
                  + name                = {
                      + type = "string"
                    }
                  + privateEndpoints    = {
                      + metadata = {
                          + description = "Private endpoints. Empty if no private network access selected."
                        }
                      + type     = "array"
                    }
                  + publicNetworkAccess = {
                      + defaultValue = true
                      + type         = "bool"
                    }
                  + resourceGroupId     = {
                      + type = "string"
                    }
                  + sku                 = {
                      + type = "object"
                    }
                  + tagsByResource      = {
                      + type = "object"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2023-02-21-preview"
                      + identity   = "[if(parameters('cmkEnabled'), parameters('identity'), json('null'))]"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('name')]"
                      + properties = {
                          + authAppId           = "[parameters('authAppID')]"
                          + corsRules           = "[parameters('corsRules')]"
                          + dataPartitionNames  = "[parameters('dataPartitionNames')]"
                          + encryption          = "[if(parameters('cmkEnabled'), parameters('encryption'), json('null'))]"
                          + publicNetworkAccess = "[if(bool(parameters('publicNetworkAccess')), 'Enabled', 'Disabled')]"
                          + sku                 = "[parameters('sku')]"
                        }
                      + tags       = "[ if(contains(parameters('tagsByResource'), 'Microsoft.OpenEnergyPlatform/energyServices'), parameters('tagsByResource')['Microsoft.OpenEnergyPlatform/energyServices'], json('{}')) ]"
                      + type       = "Microsoft.OpenEnergyPlatform/energyServices"
                    },
                  + {
                      + apiVersion     = "2017-05-10"
                      + condition      = "[not(parameters('publicNetworkAccess'))]"
                      + copy           = {
                          + count = "[length(parameters('privateEndpoints'))]"
                          + name  = "privateendpointscopy"
                        }
                      + dependsOn      = [
                          + "[parameters('name')]",
                        ]
                      + name           = "[concat('PrivateEndpoint-', parameters('privateEndpoints')[copyIndex()].privateEndpoint.name, '-', uniqueString(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name)  )]"
                      + properties     = {
                          + mode     = "Incremental"
                          + template = {
                              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
                              + contentVersion = "1.0.0.0"
                              + resources      = [
                                  + {
                                      + apiVersion = "2021-05-01"
                                      + location   = "[parameters('privateEndpoints')[copyIndex()].privateEndpoint.location]"
                                      + name       = "[parameters('privateEndpoints')[copyIndex()].privateEndpoint.name]"
                                      + properties = {
                                          + privateLinkServiceConnections = [
                                              + {
                                                  + name       = "[parameters('privateEndpoints')[copyIndex()].privateEndpoint.name]"
                                                  + properties = {
                                                      + groupIds             = "[parameters('privateEndpoints')[copyIndex()].privateEndpoint.properties.privateLinkServiceConnections[0].properties.groupIds]"
                                                      + privateLinkServiceId = "[concat(parameters('resourceGroupId'), '/providers/Microsoft.OpenEnergyPlatform/energyServices/', parameters('name'))]"
                                                    }
                                                },
                                            ]
                                          + subnet                        = {
                                              + id = "[parameters('privateEndpoints')[copyIndex()].privateEndpoint.properties.subnet.id]"
                                            }
                                        }
                                      + type       = "Microsoft.Network/privateEndpoints"
                                    },
                                ]
                            }
                        }
                      + resourceGroup  = "[parameters('privateEndpoints')[copyIndex()].resourceGroup.value.name]"
                      + subscriptionId = "[parameters('privateEndpoints')[copyIndex()].subscription.subscriptionId]"
                      + type           = "Microsoft.Resources/deployments"
                    },
                  + {
                      + apiVersion = "2017-05-10"
                      + copy       = {
                          + count = "[length(parameters('privateEndpoints'))]"
                          + name  = "privateendpointscopy"
                        }
                      + dependsOn  = [
                          + "[concat('Microsoft.Resources/deployments/',concat('PrivateEndpoint-', parameters('privateEndpoints')[copyIndex()].privateEndpoint.name, '-',uniqueString(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name) ) )]",
                        ]
                      + name       = "[concat('PrivateDNSZone','-', parameters('privateEndpoints')[copyIndex()].privateEndpoint.name,'-', uniqueString(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name) ) ]"
                      + properties = {
                          + mode     = "Incremental"
                          + template = {
                              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
                              + contentVersion = "1.0.0.0"
                              + resources      = [
                                  + {
                                      + apiVersion     = "2017-05-10"
                                      + name           = "[concat('PrivateDNSZone','-', parameters('privateEndpoints')[copyIndex()].privateEndpoint.name,'-', uniqueString(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name),'-meds' ) ]"
                                      + properties     = {
                                          + mode     = "Incremental"
                                          + template = {
                                              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
                                              + contentVersion = "1.0.0.0"
                                              + resources      = [
                                                  + {
                                                      + apiVersion = "2018-09-01"
                                                      + location   = "global"
                                                      + name       = "privatelink.energy.azure.com"
                                                      + properties = {}
                                                      + tags       = {}
                                                      + type       = "Microsoft.Network/privateDnsZones"
                                                    },
                                                ]
                                            }
                                        }
                                      + resourceGroup  = "[parameters('privateEndpoints')[copyIndex()].resourceGroup.value.name]"
                                      + subscriptionId = "[parameters('privateEndpoints')[copyIndex()].subscription.subscriptionId]"
                                      + type           = "Microsoft.Resources/deployments"
                                    },
                                  + {
                                      + apiVersion     = "2017-05-10"
                                      + name           = "[concat('PrivateDNSZone','-', parameters('privateEndpoints')[copyIndex()].privateEndpoint.name,'-', uniqueString(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name),'-storage' ) ]"
                                      + properties     = {
                                          + mode     = "Incremental"
                                          + template = {
                                              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
                                              + contentVersion = "1.0.0.0"
                                              + resources      = [
                                                  + {
                                                      + apiVersion = "2018-09-01"
                                                      + location   = "global"
                                                      + name       = "privatelink.blob.core.windows.net"
                                                      + properties = {}
                                                      + tags       = {}
                                                      + type       = "Microsoft.Network/privateDnsZones"
                                                    },
                                                ]
                                            }
                                        }
                                      + resourceGroup  = "[parameters('privateEndpoints')[copyIndex()].resourceGroup.value.name]"
                                      + subscriptionId = "[parameters('privateEndpoints')[copyIndex()].subscription.subscriptionId]"
                                      + type           = "Microsoft.Resources/deployments"
                                    },
                                ]
                            }
                        }
                      + type       = "Microsoft.Resources/deployments"
                    },
                  + {
                      + apiVersion = "2017-05-10"
                      + copy       = {
                          + count = "[length(parameters('privateEndpoints'))]"
                          + name  = "privateendpointscopy"
                        }
                      + dependsOn  = [
                          + "[concat('PrivateDNSZone','-', parameters('privateEndpoints')[copyIndex()].privateEndpoint.name,'-', uniqueString(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name) ) ]",
                          + "[concat('Microsoft.Resources/deployments/', concat('PrivateEndpoint-', parameters('privateEndpoints')[copyIndex()].privateEndpoint.name, '-',uniqueString(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name) ) )]",
                        ]
                      + name       = "[concat('VirtualNetworkLink', '-', parameters('privateEndpoints')[copyIndex()].privateEndpoint.name,'-', uniqueString(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name))]"
                      + properties = {
                          + mode     = "Incremental"
                          + template = {
                              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
                              + contentVersion = "1.0.0.0"
                              + resources      = [
                                  + {
                                      + apiVersion     = "2017-05-10"
                                      + name           = "VirtualNetworklinks1"
                                      + properties     = {
                                          + mode     = "Incremental"
                                          + template = {
                                              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
                                              + contentVersion = "1.0.0.0"
                                              + resources      = [
                                                  + {
                                                      + apiVersion = "2018-09-01"
                                                      + location   = "global"
                                                      + name       = "[concat('privatelink.energy.azure.com', '/', uniqueString(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name) )]"
                                                      + properties = {
                                                          + registrationEnabled = false
                                                          + virtualNetwork      = {
                                                              + id = "[substring(parameters('privateEndpoints')[copyIndex()].privateEndpoint.properties.subnet.id,0, sub(indexOf( parameters('privateEndpoints')[copyIndex()].privateEndpoint.properties.subnet.id, 'subnets/'), 1) ) ]"
                                                            }
                                                        }
                                                      + type       = "Microsoft.Network/privateDnsZones/virtualNetworkLinks"
                                                    },
                                                ]
                                            }
                                        }
                                      + resourceGroup  = "[parameters('privateEndpoints')[copyIndex()].resourceGroup.value.name]"
                                      + subscriptionId = "[parameters('privateEndpoints')[copyIndex()].subscription.subscriptionId]"
                                      + type           = "Microsoft.Resources/deployments"
                                    },
                                  + {
                                      + apiVersion     = "2017-05-10"
                                      + name           = "VirtualNetworklinks2"
                                      + properties     = {
                                          + mode     = "Incremental"
                                          + template = {
                                              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
                                              + contentVersion = "1.0.0.0"
                                              + resources      = [
                                                  + {
                                                      + apiVersion = "2018-09-01"
                                                      + location   = "global"
                                                      + name       = "[concat('privatelink.blob.core.windows.net', '/',uniqueString(uniqueString(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name) ))]"
                                                      + properties = {
                                                          + registrationEnabled = false
                                                          + virtualNetwork      = {
                                                              + id = "[substring(parameters('privateEndpoints')[copyIndex()].privateEndpoint.properties.subnet.id, 0, sub(indexOf( parameters('privateEndpoints')[copyIndex()].privateEndpoint.properties.subnet.id, 'subnets/'), 1) ) ]"
                                                            }
                                                        }
                                                      + type       = "Microsoft.Network/privateDnsZones/virtualNetworkLinks"
                                                    },
                                                ]
                                            }
                                        }
                                      + resourceGroup  = "[parameters('privateEndpoints')[copyIndex()].resourceGroup.value.name]"
                                      + subscriptionId = "[parameters('privateEndpoints')[copyIndex()].subscription.subscriptionId]"
                                      + type           = "Microsoft.Resources/deployments"
                                    },
                                ]
                            }
                        }
                      + type       = "Microsoft.Resources/deployments"
                    },
                  + {
                      + apiVersion     = "2017-05-10"
                      + condition      = "[not(parameters('publicNetworkAccess'))]"
                      + copy           = {
                          + count = "[length(parameters('privateEndpoints'))]"
                          + name  = "privateendpointdnscopy"
                        }
                      + dependsOn      = [
                          + "[concat('Microsoft.Resources/deployments/', concat('PrivateEndpoint-', parameters('privateEndpoints')[copyIndex()].privateEndpoint.name, '-',uniqueString(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name) ))]",
                          + "[concat('PrivateDNSZone','-', parameters('privateEndpoints')[copyIndex()].privateEndpoint.name,'-', uniqueString(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name) ) ]",
                        ]
                      + name           = "[concat('DnsZoneGroup-', parameters('privateEndpoints')[copyIndex()].privateEndpoint.name)]"
                      + properties     = {
                          + mode     = "Incremental"
                          + template = {
                              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
                              + contentVersion = "1.0.0.0"
                              + resources      = [
                                  + {
                                      + apiVersion = "2021-05-01"
                                      + location   = "[parameters('privateEndpoints')[copyIndex()].privateEndpoint.location]"
                                      + name       = "[concat(parameters('privateEndpoints')[copyIndex()].privateEndpoint.name, '/', 'default')]"
                                      + properties = {
                                          + privateDnsZoneConfigs = [
                                              + {
                                                  + name       = "privatelink-energy-azure-com"
                                                  + properties = {
                                                      + privateDnsZoneId = "[concat( '/subscriptions/', parameters('privateEndpoints')[copyIndex()].subscription.subscriptionId, '/resourceGroups/', parameters('privateEndpoints')[copyIndex()].resourceGroup.value.name, '/providers/Microsoft.Network/privateDnsZones/privatelink.energy.azure.com')]"
                                                    }
                                                },
                                              + {
                                                  + name       = "privatelink-blob-core-windows-net"
                                                  + properties = {
                                                      + privateDnsZoneId = "[concat( '/subscriptions/' ,parameters('privateEndpoints')[copyIndex()].subscription.subscriptionId , '/resourceGroups/', parameters('privateEndpoints')[copyIndex()].resourceGroup.value.name, '/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net')]"
                                                    }
                                                },
                                            ]
                                        }
                                      + type       = "Microsoft.Network/privateEndpoints/privateDnsZoneGroups"
                                    },
                                ]
                            }
                        }
                      + resourceGroup  = "[parameters('privateEndpoints')[copyIndex()].resourceGroup.value.name]"
                      + subscriptionId = "[parameters('privateEndpoints')[copyIndex()].subscription.subscriptionId]"
                      + type           = "Microsoft.Resources/deployments"
                    },
                ]
            }
        )
    }

  # azurerm_subnet.adme will be created
  + resource "azurerm_subnet" "adme" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "default"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg12"
      + virtual_network_name                          = "vnet_adme"
    }

  # azurerm_virtual_network.adme will be created
  + resource "azurerm_virtual_network" "adme" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "northeurope"
      + name                           = "vnet_adme"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg12"
      + subnet                         = (known after apply)
    }

  # null_resource.delete_template_resources will be created
  + resource "null_resource" "delete_template_resources" {
      + id       = (known after apply)
      + triggers = {
          + "adme_name"                       = "tesadwwhgsyghh"
          + "deployment_name"                 = "tesadwwhgsyghh"
          + "dns_zone_blob"                   = "privatelink.blob.core.windows.net"
          + "dns_zone_energy"                 = "privatelink.energy.azure.com"
          + "private_endpoints_name"          = "PrivateEndpoint848"
          + "private_link_service_connection" = (known after apply)
          + "resource_group"                  = "rg12"
          + "subscription_id"                 = "417b4d8b-8673-4b95-9e59-429818b22af1"
        }
    }

  # random_id.private_link_service_connection_id will be created
  + resource "random_id" "private_link_service_connection_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 16
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @enbolstad, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*